tap "homebrew/bundle"
tap "tdewolff/tap"

brew "bash"
brew "deno"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "gopls"
brew "govulncheck"
brew "graphviz"
brew "jpeg-xl"
brew "jq"
brew "kitty"
brew "libavif"
brew "lua-language-server"
brew "minify"
brew "neovim"
brew "pandoc"
brew "pyright"
brew "python"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "rust-analyzer"
brew "staticcheck"
brew "swiftformat"
brew "swiftlint"
brew "tmux"
brew "vscode-langservers-extracted"
brew "webp"

cask "discord"
cask "figma"
cask "font-intel-one-mono"
cask "font-source-code-pro"
cask "github"
cask "google-chrome"
cask "kitty"
cask "notion"
cask "rectangle"
cask "virtualbox" if Hardware::CPU.intel?
cask "visual-studio-code"
