tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "tshakalekholoane/taps"

brew "black"
brew "can"
brew "fd"
brew "fish"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "hyperfine"
brew "jq"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "python"
brew "ripgrep"
brew "swiftformat"
brew "swiftlint"
brew "tmux"

cask "arc"
cask "discord"
cask "font-source-code-pro"
cask "github"
cask "notion"
cask "rectangle"
cask "virtualbox" if Hardware::CPU.intel?
cask "visual-studio-code"
