tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "tshakalekholoane/taps"

brew "bash-language-server"
brew "black"
brew "can"
brew "deno"
brew "fd"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "gopls"
brew "hyperfine"
brew "jq"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "pyright"
brew "python"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "rust-analyzer"
brew "staticcheck"
brew "swiftformat"
brew "swiftlint"
brew "tmux"
brew "vscode-langservers-extracted"

cask "arc"
cask "discord"
cask "font-source-code-pro"
cask "github"
cask "kitty"
cask "notion"
cask "rectangle"
cask "virtualbox" if Hardware::CPU.intel?
cask "visual-studio-code"
