tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bash"
brew "clang-format"
brew "deno"
brew "fd"
brew "fish"
brew "gcc"
brew "go"
brew "gh"
brew "gnupg"
brew "jq"
brew "lua-language-server"
brew "python"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "swiftformat"
brew "swiftlint"
brew "tldr"
brew "tmux"
brew "watch"
cask "alacritty"
